In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic_data = pd.read_csv("https://raw.githubusercontent.com/dphi-official/First_ML_Model/master/titanic.csv", index_col = 'PassengerId')
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Name        891 non-null object
Sex         891 non-null object
Age         714 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Ticket      891 non-null object
Fare        891 non-null float64
Cabin       204 non-null object
Embarked    889 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [4]:
titanic_data.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
titanic_data['Fare'].count()

891

In [6]:
titanic_data['Fare'].isnull().sum()

0

In [7]:
titanic_data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [8]:
titanic_data['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [9]:
len(titanic_data[titanic_data['SibSp'] > 0])

283

In [10]:
titanic_data.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [11]:
titanic_data['SibSp'].mode()

0    0
dtype: int64

In [12]:
len(titanic_data[titanic_data['Survived'] == 1])

342

In [13]:
survived_proportion = round(len(titanic_data[titanic_data['Survived'] == 1]) / len(titanic_data),2)
survived_proportion

0.38

In [14]:
medianfare = round(titanic_data['Fare'].median(), 4)
medianfare

14.4542

In [15]:
titanic_data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [16]:
survived_data = titanic_data[titanic_data['Survived'] == 1]
len(survived_data)

342

In [17]:
survived_data['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [18]:
survived_data['Sex'].value_counts()/len(survived_data)*100

female    68.128655
male      31.871345
Name: Sex, dtype: float64

In [19]:
survived_data.shape

(342, 11)

In [20]:
len(survived_data[survived_data['Age'] < 18])

61

In [21]:
len(survived_data[survived_data['Age'] > 18])

220

In [22]:
survived = {}
for age in survived_data['Age']:
    if age < 18:
        if 'Below18' in survived:
            survived['Below18'] += 1
        else:
            survived['Below18'] = 1
    elif age > 18:
        if 'Above18' in survived:
            survived['Above18'] += 1
        else:
            survived['Above18'] = 1
    else:
        if 'NAN' in survived:
            survived['NAN'] += 1
        else:
            survived['NAN'] = 1
survived

{'Above18': 220, 'Below18': 61, 'NAN': 61}

In [23]:
total = {}
for age in titanic_data['Age']:
    if age < 18:
        if 'Below18' in total:
            total['Below18'] += 1
        else:
            total['Below18'] = 1
    elif age > 18:
        if 'Above18' in total:
            total['Above18'] += 1
        else:
            total['Above18'] = 1
    else:
        if 'NAN' in total:
            total['NAN'] += 1
        else:
            total['NAN'] = 1

total

{'Above18': 575, 'NAN': 203, 'Below18': 113}

In [24]:
round((61/113)*100,2)

53.98

In [25]:
round((220/575)*100,2)

38.26

In [26]:
print('% of children who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Age'] < 18]))
print('% of adults who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Age'] > 18]))

% of children who survived 53.98230088495575
% of adults who survived 38.26086956521739

In [27]:
print('% of men who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Sex'] == 'male']))
print('% of women who survived', 100*np.mean(titanic_data['Survived'][titanic_data['Sex'] == 'female']))

% of men who survived 18.890814558058924
% of women who survived 74.20382165605095

In [28]:
titanic_data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [29]:
np.mean(titanic_data[titanic_data['Pclass'] == 1]['Survived'])*100

62.96296296296296

In [30]:
print('% of passengers who survived in first class', 100*np.mean(titanic_data['Survived'][titanic_data['Pclass'] == 1]))
print('% of passengers who survived in other class', 100*np.mean(titanic_data['Survived'][titanic_data['Pclass'] > 1]))

% of passengers who survived in first class 62.96296296296296
% of passengers who survived in other class 30.518518518518515

In [31]:
survived_data['Pclass'].value_counts()/len(titanic_data)*100

1    15.263749
3    13.355780
2     9.764310
Name: Pclass, dtype: float64

In [32]:
survived_data['Embarked'].value_counts()

S    217
C     93
Q     30
Name: Embarked, dtype: int64

In [33]:
corrdetails = titanic_data.corr()
corrdetails

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [34]:
titanic_data['Fare'].nlargest()

PassengerId
259    512.3292
680    512.3292
738    512.3292
28     263.0000
89     263.0000
Name: Fare, dtype: float64

In [35]:
titanic_data['Age'].median()

28.0

In [36]:
len(titanic_data['Name'].unique())

891